app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @artist = Artist.find(params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "songs" ("title", "album", "preview_url", "artist_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Routes are Cool"], ["album", "Github"], ["preview_url", "www.xyz.com"], ["artist_id", 1]]
---
  def create
    @artist = Artist.find(params[:artist_id])
    @song = Song.create(song_params)

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @artist = Artist.find(params[:artist_id])
    @song = Song.find(params[:id])